{
    "default.buttonLabel": "Добавить ещё",
    "default.data.path": "path",
    "description": "Компонент, позволяющий исполнителю самостоятельно добавлять и удалять элементы списка, например текстовые поля для заполнения.\n\nТак вы сможете разрешить исполнителю дать несколько ответов на вопрос.\n\n[Посмотреть пример в песочнице](https://ya.cc/t/xf4LDQxv3twaqu)\n\nВ элементах может быть любой компонент, в том числе список других компонентов. Например, это позволит создать таблицу, в которую можно добавлять и удалять строки.\n\n[Посмотреть пример в песочнице](https://ya.cc/t/tVHr1NWP3twdKm)\n\n## Управление компонентом\n\nДля добавления нового элемента списка надо нажать на кнопку. Для удаления — на крестик справа (появляется при наведении на элемент списка).\n\nЧтобы запретить исполнителю добавлять слишком много элементов списка, установите максимальную длину списка. Вы также можете заблокировать управление компонентом с помощью свойства `editable`, например при наступлении какого-то события.",
    "properties.buttonLabel.default": "Добавить ещё",
    "properties.buttonLabel.description": "Текст на кнопке добавления элементов.",
    "properties.direction.description": "Направление списка:\n* `vertical` (по умолчанию) — вертикальное.\n* `horizontal` — горизонтальное.",
    "properties.editable.description": "Свойство, которое указывает, разрешено ли добавление и удаление элементов. Укажите `false`, чтобы запретить. По умолчанию `true` — разрешено. ",
    "properties.maxLength.description": "Максимальное количество элементов.",
    "properties.render.description": "Шаблон интерфейса для элементов списка, например текстовое поле.\n\nВ во вложенных компонентах `field.*` для записи ответов используйте `data.relative`, иначе во всех элементах списка будет одно и то же значение.",
    "properties.size.description": "Расстояние между элементами. Допустимые значения в порядке возрастания: `s`, `m` (по умолчанию).",
    "shortDescription": "Компонент, позволяющий исполнителю самостоятельно добавлять и удалять элементы списка, например текстовые поля для заполнения. Так вы сможете разрешить исполнителю дать несколько ответов на вопрос."
}
