{
    "default.data.path": "path",
    "default.label": "Загрузка фото и видео",
    "description": "Добавляет кнопки для разных видов загрузки файлов: загрузить фото или видео, выбрать файлы из файлового менеджера или галереи. Настройте в свойстве `accept`, какая из кнопок вам нужна.\n\nПо умолчанию разрешает загрузить только один файл, но можно позволить загружать несколько в свойстве `multiple`.\n\nКомпонент будет удобен при работе с мобильных устройств. Для загрузки файлов с компьютера лучше использовать [field.file](field.file.md) для более гибкой настройки типов загружаемых файлов.\n\nВ режиме проверки задания загруженные изображения появятся автоматически. Изображения можно просматривать, поворачивать и переключаться между ними.\n\n[Посмотреть пример в песочнице](https://ya.cc/t/v8860Jri3twhDG)\n\n## Особенности работы в мобильном приложении Толоки\n\nВ мобильном приложении Толоки кнопки для фото и видео откроют камеру, а кнопки галереи и файлового менеджера — соответствующие приложения.\n\nПосле того как исполнитель отправит задание, файлы сохранятся внутри приложения и при подключении к Wi-Fi постепенно загрузятся в Толоку. Пока подключения нет, задание будет находиться в статусе «Ожидает отправку по Wi-Fi».",
    "properties.accept.description": "Добавляет разные кнопки для четырех видов загрузки. Передайте значение `true` тем из них, которые вам нужны. \n\nНапример, если нужна кнопка загрузки файлов из галереи, то добавьте в свойство `\"gallery\": true`.",
    "properties.accept.properties.fileSystem.description": "Добавляет кнопку для загрузки файла из файлового менеджера.",
    "properties.accept.properties.gallery.description": "Добавляет кнопку для загрузки файла из галереи.",
    "properties.accept.properties.photo.description": "Добавляет кнопку для загрузки изображения.",
    "properties.accept.properties.video.description": "Добавляет кнопку для загрузки видеофайла.",
    "properties.disabled.description": "Свойство разрешает или запрещает загрузку файлов. Пригодится, если вам нужно разрешить загрузку лишь при выполнении определенного условия:\n* `false` (по умолчанию) — загрузка разрешена;\n* `true` — загрузка запрещена.",
    "properties.multiple.description": "Определяет, разрешено ли загружать несколько файлов:\n* `false` (по умолчанию) — запрещено;\n* `true` — разрешено.",
    "properties.requiredCoordinates.description": "Если `true`, то нельзя будет загрузить файл без геотега.",
    "shortDescription": "Добавляет кнопки для разных видов загрузки файлов: загрузить фото или видео, выбрать файлы из файлового менеджера или галереи."
}
